newwms_gift/src/InformationRegisters/итWMS_ДанныеДокументов/итWMS_ДанныеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMS_ДанныеДокументов</name>
  <resources>
    <name>ДанныеДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПриемник</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятНаИсполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПолучатель</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMS_ДанныеДокументов/Forms/ФормаВыбораДокумента/Module.bsl
&НаКлиенте
Процедура ПосмотретьДополнительнуюИнфомарцию(Команда)
	Если ТипЗнч(ТекущийЭлемент.ТекущиеДанные.Документ)=Тип("УникальныйИдентификатор") тогда
		ОткрытьФорму("РегистрСведений.итWMS_ДанныеДокументов.Форма.ФормаДополнительнойИнформации_бетаВерсия",новый Структура("Документ",ТекущийЭлемент.ТекущиеДанные.Документ),ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Филиал")тогда
		СписокВыбора.Параметры.УстановитьЗначениеПараметра("Филиал",Параметры.Филиал);
	иначе
		СписокВыбора.Параметры.УстановитьЗначениеПараметра("Филиал",Справочники.итФилиалыWMS.ПустаяСсылка());
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ТекущийЭлемент.ТекущиеДанные.Документ);
КонецПроцедуры
